Revit 2027 API
PropertyLine.IsSketchBased Method
 Indicates if the PropertyLine element is sketch-based.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSketchBased()
Public Function IsSketchBased As Boolean
public:
bool IsSketchBased()
member IsSketchBased : unit -> bool
Return Value
Boolean
 True if the element is sketch-based, false if the element is table-based.
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace